app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cooperchia3@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def create
    # find the current user by email
    user = User.find_by(email: params[:email])
    if user.present? && user.authenticate(params[:password])