app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "janja"], ["email", "janja@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2021-12-20 23:37:24.090211"], ["updated_at", "2021-12-20 23:37:24.090211"]]
---
  def create
    # implement session based auth for now
    @user = User.new(user_params)

    # attempt to save the user to the db
    @user.save!

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "coope"], ["updated_at", "2021-12-22 04:53:26.030303"], ["id", 11]]
---
  def update
    # attempt to update the user info
    Current.user.update!(user_update_params)